optimized search item and updated ReadMe with clear block diagram
